/* automatically generated by rust-bindgen 0.72.1 */

#![allow(non_camel_case_types, non_snake_case, non_upper_case_globals)]

pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_CXX26: u32 = 0;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const _ARM_WINAPI_PARTITION_DESKTOP_SDK_AVAILABLE: u32 = 1;
pub const _CRT_BUILD_DESKTOP_APP: u32 = 1;
pub const _ARGMAX: u32 = 100;
pub const _CRT_INT_MAX: u32 = 2147483647;
pub const _CRT_FUNCTIONS_REQUIRED: u32 = 1;
pub const _CRT_HAS_CXX17: u32 = 0;
pub const _CRT_HAS_C11: u32 = 1;
pub const _CRT_INTERNAL_NONSTDC_NAMES: u32 = 1;
pub const __STDC_SECURE_LIB__: u32 = 200411;
pub const __GOT_SECURE_LIB__: u32 = 200411;
pub const __STDC_WANT_SECURE_LIB__: u32 = 1;
pub const _SECURECRT_FILL_BUFFER_PATTERN: u32 = 254;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_COUNT: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES: u32 = 1;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_MEMORY: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES_MEMORY: u32 = 0;
pub const _STATIC_INLINE_UCRT_FUNCTIONS: u32 = 0;
pub type va_list = *mut ::std::os::raw::c_char;
unsafe extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
unsafe extern "C" {
    pub fn __security_init_cookie();
}
unsafe extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
unsafe extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
unsafe extern "C" {
    pub static mut __security_cookie: usize;
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Vector3f {
    pub x: f32,
    pub y: f32,
    pub z: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Vector3f"][::std::mem::size_of::<Vector3f>() - 12usize];
    ["Alignment of Vector3f"][::std::mem::align_of::<Vector3f>() - 4usize];
    ["Offset of field: Vector3f::x"][::std::mem::offset_of!(Vector3f, x) - 0usize];
    ["Offset of field: Vector3f::y"][::std::mem::offset_of!(Vector3f, y) - 4usize];
    ["Offset of field: Vector3f::z"][::std::mem::offset_of!(Vector3f, z) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Quaternion {
    pub x: f32,
    pub y: f32,
    pub z: f32,
    pub w: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Quaternion"][::std::mem::size_of::<Quaternion>() - 16usize];
    ["Alignment of Quaternion"][::std::mem::align_of::<Quaternion>() - 4usize];
    ["Offset of field: Quaternion::x"][::std::mem::offset_of!(Quaternion, x) - 0usize];
    ["Offset of field: Quaternion::y"][::std::mem::offset_of!(Quaternion, y) - 4usize];
    ["Offset of field: Quaternion::z"][::std::mem::offset_of!(Quaternion, z) - 8usize];
    ["Offset of field: Quaternion::w"][::std::mem::offset_of!(Quaternion, w) - 12usize];
};
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum Axis {
    X = 0,
    Y = 1,
    Z = 2,
}
unsafe extern "C" {
    pub fn eng_engine_create_space() -> u32;
}
unsafe extern "C" {
    pub fn eng_engine_create_space_with_id(space_id: u32);
}
pub type __crt_bool = bool;
unsafe extern "C" {
    pub fn _invalid_parameter_noinfo();
}
unsafe extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
unsafe extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::std::os::raw::c_uint,
        _Reserved: usize,
    ) -> !;
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::std::os::raw::c_ushort,
    pub _locale_mb_cur_max: ::std::os::raw::c_int,
    pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_data_public"]
        [::std::mem::size_of::<__crt_locale_data_public>() - 16usize];
    ["Alignment of __crt_locale_data_public"]
        [::std::mem::align_of::<__crt_locale_data_public>() - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_pctype"]
        [::std::mem::offset_of!(__crt_locale_data_public, _locale_pctype) - 0usize];
    ["Offset of field: __crt_locale_data_public::_locale_mb_cur_max"]
        [::std::mem::offset_of!(__crt_locale_data_public, _locale_mb_cur_max) - 8usize];
    ["Offset of field: __crt_locale_data_public::_locale_lc_codepage"]
        [::std::mem::offset_of!(__crt_locale_data_public, _locale_lc_codepage) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __crt_locale_pointers"][::std::mem::size_of::<__crt_locale_pointers>() - 16usize];
    ["Alignment of __crt_locale_pointers"]
        [::std::mem::align_of::<__crt_locale_pointers>() - 8usize];
    ["Offset of field: __crt_locale_pointers::locinfo"]
        [::std::mem::offset_of!(__crt_locale_pointers, locinfo) - 0usize];
    ["Offset of field: __crt_locale_pointers::mbcinfo"]
        [::std::mem::offset_of!(__crt_locale_pointers, mbcinfo) - 8usize];
};
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of _Mbstatet"][::std::mem::size_of::<_Mbstatet>() - 8usize];
    ["Alignment of _Mbstatet"][::std::mem::align_of::<_Mbstatet>() - 4usize];
    ["Offset of field: _Mbstatet::_Wchar"][::std::mem::offset_of!(_Mbstatet, _Wchar) - 0usize];
    ["Offset of field: _Mbstatet::_Byte"][::std::mem::offset_of!(_Mbstatet, _Byte) - 4usize];
    ["Offset of field: _Mbstatet::_State"][::std::mem::offset_of!(_Mbstatet, _State) - 6usize];
};
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
unsafe extern "C" {
    pub fn _wassert(_Message: *const wchar_t, _File: *const wchar_t, _Line: ::std::os::raw::c_uint);
}
unsafe extern "C" {
    pub fn eng_space_step(space_id: u32, steps: f32);
}
unsafe extern "C" {
    pub fn eng_space_get_gravity(space_id: u32) -> Vector3f;
}
unsafe extern "C" {
    pub fn eng_space_set_gravity(space_id: u32, gravity: Vector3f);
}
unsafe extern "C" {
    pub fn eng_space_remove_body(space_id: u32, body_id: i64);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RuntimeStats {
    pub body_count: i32,
    pub collider_count: i32,
    pub active_body_count: i32,
    pub contact_pair_count: i32,
    pub contact_manifold_count: i32,
    pub contact_point_count: i32,
    pub dynamic_dynamic_contact_pair_count: i32,
    pub terrain_contact_pair_count: i32,
    pub active_island_count: i32,
    pub joint_count: i32,
    pub available: i8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RuntimeStats"][::std::mem::size_of::<RuntimeStats>() - 44usize];
    ["Alignment of RuntimeStats"][::std::mem::align_of::<RuntimeStats>() - 4usize];
    ["Offset of field: RuntimeStats::body_count"]
        [::std::mem::offset_of!(RuntimeStats, body_count) - 0usize];
    ["Offset of field: RuntimeStats::collider_count"]
        [::std::mem::offset_of!(RuntimeStats, collider_count) - 4usize];
    ["Offset of field: RuntimeStats::active_body_count"]
        [::std::mem::offset_of!(RuntimeStats, active_body_count) - 8usize];
    ["Offset of field: RuntimeStats::contact_pair_count"]
        [::std::mem::offset_of!(RuntimeStats, contact_pair_count) - 12usize];
    ["Offset of field: RuntimeStats::contact_manifold_count"]
        [::std::mem::offset_of!(RuntimeStats, contact_manifold_count) - 16usize];
    ["Offset of field: RuntimeStats::contact_point_count"]
        [::std::mem::offset_of!(RuntimeStats, contact_point_count) - 20usize];
    ["Offset of field: RuntimeStats::dynamic_dynamic_contact_pair_count"]
        [::std::mem::offset_of!(RuntimeStats, dynamic_dynamic_contact_pair_count) - 24usize];
    ["Offset of field: RuntimeStats::terrain_contact_pair_count"]
        [::std::mem::offset_of!(RuntimeStats, terrain_contact_pair_count) - 28usize];
    ["Offset of field: RuntimeStats::active_island_count"]
        [::std::mem::offset_of!(RuntimeStats, active_island_count) - 32usize];
    ["Offset of field: RuntimeStats::joint_count"]
        [::std::mem::offset_of!(RuntimeStats, joint_count) - 36usize];
    ["Offset of field: RuntimeStats::available"]
        [::std::mem::offset_of!(RuntimeStats, available) - 40usize];
};
unsafe extern "C" {
    pub fn eng_space_get_runtime_stats(space_id: u32) -> RuntimeStats;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct StepPhaseStats {
    pub step_nanos: i64,
    pub broad_phase_nanos: i64,
    pub narrow_phase_nanos: i64,
    pub solver_nanos: i64,
    pub ccd_nanos: i64,
    pub snapshot_nanos: i64,
    pub available: i8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of StepPhaseStats"][::std::mem::size_of::<StepPhaseStats>() - 56usize];
    ["Alignment of StepPhaseStats"][::std::mem::align_of::<StepPhaseStats>() - 8usize];
    ["Offset of field: StepPhaseStats::step_nanos"]
        [::std::mem::offset_of!(StepPhaseStats, step_nanos) - 0usize];
    ["Offset of field: StepPhaseStats::broad_phase_nanos"]
        [::std::mem::offset_of!(StepPhaseStats, broad_phase_nanos) - 8usize];
    ["Offset of field: StepPhaseStats::narrow_phase_nanos"]
        [::std::mem::offset_of!(StepPhaseStats, narrow_phase_nanos) - 16usize];
    ["Offset of field: StepPhaseStats::solver_nanos"]
        [::std::mem::offset_of!(StepPhaseStats, solver_nanos) - 24usize];
    ["Offset of field: StepPhaseStats::ccd_nanos"]
        [::std::mem::offset_of!(StepPhaseStats, ccd_nanos) - 32usize];
    ["Offset of field: StepPhaseStats::snapshot_nanos"]
        [::std::mem::offset_of!(StepPhaseStats, snapshot_nanos) - 40usize];
    ["Offset of field: StepPhaseStats::available"]
        [::std::mem::offset_of!(StepPhaseStats, available) - 48usize];
};
unsafe extern "C" {
    pub fn eng_space_get_step_phase_stats(space_id: u32) -> StepPhaseStats;
}
unsafe extern "C" {
    pub fn eng_space_reset_step_phase_stats(space_id: u32);
}
unsafe extern "C" {
    pub fn eng_space_create_static_plane(space_id: u32, groundY: f32) -> i64;
}
unsafe extern "C" {
    pub fn eng_space_create_box(space_id: u32, half_extent: Vector3f, mass: f32) -> i64;
}
unsafe extern "C" {
    pub fn eng_space_create_sphere(space_id: u32, radius: f32, mass: f32) -> i64;
}
unsafe extern "C" {
    pub fn eng_space_create_capsule(
        space_id: u32,
        radius: f32,
        halfHeight: f32,
        axis: i32,
        mass: f32,
    ) -> i64;
}
unsafe extern "C" {
    pub fn eng_space_create_cylinder(
        space_id: u32,
        radius: f32,
        halfHeight: f32,
        axis: i32,
        mass: f32,
    ) -> i64;
}
unsafe extern "C" {
    pub fn eng_space_create_cone(
        space_id: u32,
        radius: f32,
        halfHeight: f32,
        axis: i32,
        mass: f32,
    ) -> i64;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct RayHit {
    pub body_id: i64,
    pub point: Vector3f,
    pub normal: Vector3f,
    pub fraction: f32,
    pub distance: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of RayHit"][::std::mem::size_of::<RayHit>() - 40usize];
    ["Alignment of RayHit"][::std::mem::align_of::<RayHit>() - 8usize];
    ["Offset of field: RayHit::body_id"][::std::mem::offset_of!(RayHit, body_id) - 0usize];
    ["Offset of field: RayHit::point"][::std::mem::offset_of!(RayHit, point) - 8usize];
    ["Offset of field: RayHit::normal"][::std::mem::offset_of!(RayHit, normal) - 20usize];
    ["Offset of field: RayHit::fraction"][::std::mem::offset_of!(RayHit, fraction) - 32usize];
    ["Offset of field: RayHit::distance"][::std::mem::offset_of!(RayHit, distance) - 36usize];
};
unsafe extern "C" {
    pub fn eng_space_raycast_closest(space_id: u64, from: Vector3f, to: Vector3f) -> RayHit;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Contact {
    pub bodyA_id: i64,
    pub bodyB_id: i64,
    pub pointOnA: Vector3f,
    pub pointOnB: Vector3f,
    pub normalOnB: Vector3f,
    pub distance: f32,
    pub impulse: f32,
    pub _pad: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Contact"][::std::mem::size_of::<Contact>() - 64usize];
    ["Alignment of Contact"][::std::mem::align_of::<Contact>() - 8usize];
    ["Offset of field: Contact::bodyA_id"][::std::mem::offset_of!(Contact, bodyA_id) - 0usize];
    ["Offset of field: Contact::bodyB_id"][::std::mem::offset_of!(Contact, bodyB_id) - 8usize];
    ["Offset of field: Contact::pointOnA"][::std::mem::offset_of!(Contact, pointOnA) - 16usize];
    ["Offset of field: Contact::pointOnB"][::std::mem::offset_of!(Contact, pointOnB) - 28usize];
    ["Offset of field: Contact::normalOnB"][::std::mem::offset_of!(Contact, normalOnB) - 40usize];
    ["Offset of field: Contact::distance"][::std::mem::offset_of!(Contact, distance) - 52usize];
    ["Offset of field: Contact::impulse"][::std::mem::offset_of!(Contact, impulse) - 56usize];
    ["Offset of field: Contact::_pad"][::std::mem::offset_of!(Contact, _pad) - 60usize];
};
unsafe extern "C" {
    pub fn eng_space_get_contacts(space_id: u32, output: *mut Contact, max_contacts: i32) -> i32;
}
unsafe extern "C" {
    pub fn eng_space_create_fixed_joint(
        space_id: u32,
        bodyA: i64,
        bodyB: i64,
        anchorA: Vector3f,
        anchorB: Vector3f,
    ) -> i64;
}
unsafe extern "C" {
    pub fn eng_space_create_point_joint(
        space_id: u32,
        bodyA: i64,
        bodyB: i64,
        anchorA: Vector3f,
        anchorB: Vector3f,
    ) -> i64;
}
unsafe extern "C" {
    pub fn eng_space_create_hinge_joint(
        space_id: u32,
        bodyA: i64,
        bodyB: i64,
        anchorA: Vector3f,
        anchorB: Vector3f,
        axis: Vector3f,
    ) -> i64;
}
unsafe extern "C" {
    pub fn eng_space_create_slider_joint(
        space_id: u32,
        bodyA: i64,
        bodyB: i64,
        anchorA: Vector3f,
        anchorB: Vector3f,
        axis: Vector3f,
    ) -> i64;
}
unsafe extern "C" {
    pub fn eng_space_create_spring_joint(
        space_id: u32,
        bodyA: u64,
        bodyB: u64,
        anchorA: Vector3f,
        anchorB: Vector3f,
        restLength: f32,
        stiffness: f32,
        damping: f32,
    ) -> i64;
}
unsafe extern "C" {
    pub fn eng_space_remove_joint(space_id: u32, joint_id: u64);
}
unsafe extern "C" {
    pub fn eng_space_get_joint_count(space_id: u32) -> u32;
}
unsafe extern "C" {
    pub fn eng_space_destroy(space_id: u32);
}
pub type JointCallback = ::std::option::Option<
    unsafe extern "C" fn(joint_id: u64, user_data: *mut ::std::os::raw::c_void),
>;
unsafe extern "C" {
    pub fn eng_space_iterate_joints(
        space_id: u32,
        callback: JointCallback,
        user_data: *mut ::std::os::raw::c_void,
    );
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BodyType {
    BODY_TYPE_STATIC = 0,
    BODY_TYPE_DYNAMIC = 1,
    BODY_TYPE_KINEMATIC = 2,
}
unsafe extern "C" {
    pub fn eng_body_get_type(space_id: u32, body_id: u64) -> BodyType;
}
unsafe extern "C" {
    pub fn eng_body_set_type(space_id: u32, body_id: u64, body_type: BodyType);
}
unsafe extern "C" {
    pub fn eng_body_is_static(space_id: u32, body_id: u64) -> bool;
}
unsafe extern "C" {
    pub fn eng_body_is_dynamic(space_id: u32, body_id: u64) -> bool;
}
unsafe extern "C" {
    pub fn eng_body_is_kinematic(space_id: u32, body_id: u64) -> bool;
}
unsafe extern "C" {
    pub fn eng_body_get_position(space_id: u32, body_id: u64) -> Vector3f;
}
unsafe extern "C" {
    pub fn eng_body_set_position(space_id: u32, body_id: u64, pos: Vector3f);
}
unsafe extern "C" {
    pub fn eng_body_get_rotation(space_id: u32, body_id: u64) -> Quaternion;
}
unsafe extern "C" {
    pub fn eng_body_set_rotation(space_id: u32, body_id: u64, rot: Quaternion);
}
unsafe extern "C" {
    pub fn eng_body_get_linear_velocity(space_id: u32, body_id: u64) -> Vector3f;
}
unsafe extern "C" {
    pub fn eng_body_set_linear_velocity(space_id: u32, body_id: u64, vel: Vector3f);
}
unsafe extern "C" {
    pub fn eng_body_get_angular_velocity(space_id: u32, body_id: u64) -> Vector3f;
}
unsafe extern "C" {
    pub fn eng_body_set_angular_velocity(space_id: u32, body_id: u64, vel: Vector3f);
}
unsafe extern "C" {
    pub fn eng_body_get_restitution(space_id: u32, body_id: u64) -> f32;
}
unsafe extern "C" {
    pub fn eng_body_set_restitution(space_id: u32, body_id: u64, restitution: f32);
}
unsafe extern "C" {
    pub fn eng_body_get_friction(space_id: u32, body_id: u64) -> f32;
}
unsafe extern "C" {
    pub fn eng_body_set_friction(space_id: u32, body_id: u64, friction: f32);
}
unsafe extern "C" {
    pub fn eng_body_get_mass(space_id: u32, body_id: u64) -> f32;
}
unsafe extern "C" {
    pub fn eng_body_set_mass(space_id: u32, body_id: u64, mass: f32);
}
unsafe extern "C" {
    pub fn eng_body_set_damping(
        space_id: u32,
        body_id: u64,
        linear_damping: f32,
        angular_damping: f32,
    );
}
unsafe extern "C" {
    pub fn eng_body_is_sensor(space_id: u32, body_id: u64) -> bool;
}
unsafe extern "C" {
    pub fn eng_body_set_sensor(space_id: u32, body_id: u64, sensor: bool);
}
unsafe extern "C" {
    pub fn eng_body_is_active(space_id: u32, body_id: u64) -> bool;
}
unsafe extern "C" {
    pub fn eng_body_set_active(space_id: u32, body_id: u64, active: bool);
}
unsafe extern "C" {
    pub fn eng_body_is_sleeping(space_id: u32, body_id: u64) -> bool;
}
unsafe extern "C" {
    pub fn eng_body_set_sleeping(space_id: u32, body_id: u64, sleep: bool);
}
unsafe extern "C" {
    pub fn eng_body_apply_force(space_id: u32, body_id: u64, force: Vector3f, offset: Vector3f);
}
unsafe extern "C" {
    pub fn eng_body_apply_impulse(space_id: u32, body_id: u64, impulse: Vector3f, offset: Vector3f);
}
unsafe extern "C" {
    pub fn eng_body_apply_torque(space_id: u32, body_id: u64, torque: Vector3f, is_impulse: bool);
}
unsafe extern "C" {
    pub fn eng_body_clear_forces(space_id: u32, body_id: u64);
}
unsafe extern "C" {
    pub fn eng_body_get_collision_group(space_id: u32, body_id: u64) -> i32;
}
unsafe extern "C" {
    pub fn eng_body_get_collision_mask(space_id: u32, body_id: u64) -> i32;
}
unsafe extern "C" {
    pub fn eng_body_is_ccd_enabled(space_id: u32, body_id: u64) -> bool;
}
unsafe extern "C" {
    pub fn eng_body_set_ccd_enabled(space_id: u32, body_id: u64, enabled: bool);
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum BodyShapeType {
    BOX = 0,
    SPHERE = 1,
    CAPSULE = 2,
    CYLINDER = 3,
    CONE = 4,
    PLANE = 5,
    VOXELS = 6,
    UNKNOWN = 7,
}
unsafe extern "C" {
    pub fn eng_body_get_shape_type(space_id: u32, body_id: u64) -> BodyShapeType;
}
unsafe extern "C" {
    pub fn eng_body_get_sphere_radius(space_id: u32, body_id: u64) -> f32;
}
unsafe extern "C" {
    pub fn eng_body_get_box_half_extents(space_id: u32, body_id: u64) -> Vector3f;
}
unsafe extern "C" {
    pub fn eng_body_get_half_height(space_id: u32, body_id: u64) -> f32;
}
unsafe extern "C" {
    pub fn eng_body_get_shape_axis(space_id: u32, body_id: u64) -> Axis;
}
unsafe extern "C" {
    pub fn eng_body_get_com_y_offset(space_id: u32, body_id: u64) -> f32;
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum eng_JointType {
    eng_JOINT_FIXED = 0,
    eng_JOINT_POINT = 1,
    eng_JOINT_HINGE = 2,
    eng_JOINT_SLIDER = 3,
    eng_JOINT_SPRING = 4,
}
unsafe extern "C" {
    pub fn eng_joint_get_type(space_id: u32, joint_id: u64) -> eng_JointType;
}
unsafe extern "C" {
    pub fn eng_joint_get_body_a(space_id: u32, joint_id: u64) -> i64;
}
unsafe extern "C" {
    pub fn eng_joint_get_body_b(space_id: u32, joint_id: u64) -> i64;
}
unsafe extern "C" {
    pub fn eng_joint_is_enabled(space_id: u32, joint_id: u64) -> bool;
}
unsafe extern "C" {
    pub fn eng_joint_set_enabled(space_id: u32, joint_id: u64, enabled: bool);
}
unsafe extern "C" {
    pub fn eng_joint_get_anchor_a(space_id: u32, joint_id: u64) -> Vector3f;
}
unsafe extern "C" {
    pub fn eng_joint_get_anchor_b(space_id: u32, joint_id: u64) -> Vector3f;
}
unsafe extern "C" {
    pub fn eng_joint_get_axis(space_id: u32, joint_id: u64) -> Vector3f;
}
unsafe extern "C" {
    pub fn eng_joint_get_lower_limit(space_id: u32, joint_id: u64) -> f32;
}
unsafe extern "C" {
    pub fn eng_joint_get_upper_limit(space_id: u32, joint_id: u64) -> f32;
}
unsafe extern "C" {
    pub fn eng_joint_set_limits(space_id: u32, joint_id: u64, lowerLimit: f32, upperLimit: f32);
}
unsafe extern "C" {
    pub fn eng_joint_is_motor_enabled(space_id: u32, joint_id: u64) -> bool;
}
unsafe extern "C" {
    pub fn eng_joint_set_motor_enabled(space_id: u32, joint_id: u64, enabled: bool);
}
unsafe extern "C" {
    pub fn eng_joint_get_motor_target_velocity(space_id: u32, joint_id: u64) -> f32;
}
unsafe extern "C" {
    pub fn eng_joint_get_motor_max_force(space_id: u32, joint_id: u64) -> f32;
}
unsafe extern "C" {
    pub fn eng_joint_set_motor(space_id: u32, joint_id: u64, targetVelocity: f32, maxForce: f32);
}
unsafe extern "C" {
    pub fn eng_joint_get_spring_rest_length(space_id: u32, joint_id: u64) -> f32;
}
unsafe extern "C" {
    pub fn eng_joint_get_spring_stiffness(space_id: u32, joint_id: u64) -> f32;
}
unsafe extern "C" {
    pub fn eng_joint_get_spring_damping(space_id: u32, joint_id: u64) -> f32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data {
    pub _address: u8,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_multibyte_data {
    pub _address: u8,
}
